src/cf/Documents/ПодтверждениеОплатыНДСВБюджет.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПодтверждениеОплатыНДСВБюджет</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявлениеОВвозеТоваров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.НДСПредъявленный</xr:Item>
				<xr:Item>AccumulationRegister.НДСЗаписиКнигиПокупок</xr:Item>
				<xr:Item>InformationRegister.ЖурналУчетаСчетовФактур</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаявлениеОВвозе</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокументаОплаты</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерДокументаОплаты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерОтметкиОРегистрации</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>18</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтметкиОРегистрации</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/ПодтверждениеОплатыНДСВБюджет/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	//Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	Если Параметры.Ключ.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
	ТекущаяДатаДокумента = Объект.Дата;
	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Объект.Дата);
	КонтролироватьОплату    = Ложь;
	
	УстановитьУсловноеОформление();

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	// СтандартныеПодсистемы.ДатыЗапретаИзменения
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.ДатыЗапретаИзменения
	
	ПодготовитьФормуНаСервере();
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПроведениеСервер.УстановитьПризнакПроверкиРеквизитов(Отказ, ТекущийОбъект, ПараметрыЗаписи);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	// СтандартныеПодсистемы.УправлениеДоступом
	УправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Если НачалоДня(Объект.Дата) = НачалоДня(ТекущаяДатаДокумента) Тогда
		// Изменение времени не влияет на поведение документа.
		ТекущаяДатаДокумента = Объект.Дата;
		Возврат;
	КонецЕсли;

	// Общие проверки условий по датам.
	ТребуетсяВызовСервера = ОбщегоНазначенияУНФКлиент.ТребуетсяВызовСервераПриИзмененииДатыДокумента(Объект.Дата, 
		ТекущаяДатаДокумента);
		
	// Если определили, что изменение даты может повлиять на какие-либо параметры, 
	// то передаем обработку на сервер.
	Если ТребуетсяВызовСервера Тогда
		ДатаПриИзмененииНаСервере();
	КонецЕсли;
	
	// Запомним новую дату документа.
	ТекущаяДатаДокумента = Объект.Дата;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСостав

&НаКлиенте
Процедура СоставПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		ЗаполнитьЗаголовкиСтрок(Элементы.Состав.ТекущиеДанные);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СоставЗаявлениеОВвозеПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	ПараметрыСтроки = Новый Структура(
		"ЗаявлениеОВвозе,НомерСтроки,НомерОтметкиОРегистрации,ДатаОтметкиОРегистрации,
		|НомерДокументаОплаты,ДатаДокументаОплаты,НетАналогичныхДокументов");
	ЗаполнитьЗначенияСвойств(ПараметрыСтроки, ТекущиеДанные, "ЗаявлениеОВвозе,НомерСтроки");
	
	РеквизитыОтметкиОРегистрации = ПолучитьРеквизитыОтметкиОРегистрации(Объект, ПараметрыСтроки);
	
	ЗаполнитьЗначенияСвойств(ТекущиеДанные, РеквизитыОтметкиОРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура СоставНомерОтметкиОРегистрацииПриИзменении(Элемент)
	
	ПриИзмененииРеквизитовОтметкиОРегистрации();
	
КонецПроцедуры

&НаКлиенте
Процедура СоставДатаОтметкиОРегистрацииПриИзменении(Элемент)
	
	 ПриИзмененииРеквизитовОтметкиОРегистрации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЕстьДанные = Объект.Состав.Количество() > 0;
	
	Если ЕстьДанные Тогда
		Если Объект.Проведен Тогда
			ТекстВопроса = НСтр("ru='Перед заполнением проведение документа будет отменено, а табличная часть будет очищена. Заполнить?'");
		Иначе
			ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Заполнить?'");
		КонецЕсли;
		Оповещение = Новый ОписаниеОповещения("ВопросЗаполнитьДокументЗавершение", ЭтотОбъект);
		ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьДокументНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()

	ЗаполнитьРеквизитыИзПараметровФормы();

	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаСервере
Процедура ДатаПриИзмененииНаСервере()

	ВерсияПостановления1137 = УчетНДСПереопределяемый.ВерсияПостановленияНДС1137(Объект.Дата);
	//КонтролироватьОплату    = УчетНДС.КонтролироватьОплатуНДСПоЗаявлениюОВвозе(Объект.Дата);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	// СоставНомерДокументаОплаты

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СоставНомерДокументаОплаты");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"ВерсияПостановления1137", ВидСравненияКомпоновкиДанных.Меньше, 3);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);

	// СоставНомерДокументаОплаты, СоставДатаДокументаОплаты - Видимость
	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СоставНомерДокументаОплаты");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СоставДатаДокументаОплаты");
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"КонтролироватьОплату", ВидСравненияКомпоновкиДанных.Равно, Ложь);

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Видимость", Ложь);
	
	// СоставНомерОтметкиОРегистрации, СоставДатаОтметкиОРегистрации

	ЭлементУО = УсловноеОформление.Элементы.Добавить();

	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СоставНомерОтметкиОРегистрации");
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "СоставДатаОтметкиОРегистрации");

	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.Дата", ВидСравненияКомпоновкиДанных.Меньше, '20160101');

	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРеквизитыИзПараметровФормы()
	
	ПараметрыЗаполненияФормы = Неопределено;
	
	Если Параметры.Свойство("ПараметрыЗаполненияФормы",ПараметрыЗаполненияФормы) Тогда
	
		ЗаполнитьЗначенияСвойств(Объект,ПараметрыЗаполненияФормы);
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьДокументНаКлиенте()
	
	ЗаполнитьДокументНаСервере();
	
	Если Объект.Состав.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru='Заявления о ввозе с неподтвержденной оплатой не обнаружены.'");
		ПоказатьПредупреждение(, ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере()

	Если Объект.Проведен Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения));
	КонецЕсли;
	
	Объект.Состав.Очистить();
	
	СтруктураПараметров = Новый Структура("Дата,Организация,Основание");
	ЗаполнитьЗначенияСвойств(СтруктураПараметров, Объект);
	
	ДанныеДляЗаполнения = Документы.ПодтверждениеОплатыНДСВБюджет.ПодготовитьДанныеДляЗаполнения(СтруктураПараметров);
	Объект.Состав.Загрузить(ДанныеДляЗаполнения);
	
	ЗаполнитьДобавленныеКолонкиТаблиц();
	
КонецПроцедуры

&НаКлиенте
Процедура ВопросЗаполнитьДокументЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЗаполнитьДокументНаКлиенте();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц()

	Для Каждого СтрокаТаблицы Из Объект.Состав Цикл
		ЗаполнитьДобавленныеКолонкиСтрокиТаблицыСостав(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаполнитьДобавленныеКолонкиСтрокиТаблицыСостав(СтрокаТаблицы)
	
	ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьЗаголовкиСтрок(СтрокаТаблицы)
	
	СтрокаТаблицы.НадписьНомер = НСтр("ru = 'Номер:'");
	СтрокаТаблицы.НадписьДата  = НСтр("ru = 'Дата:'");
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииРеквизитовОтметкиОРегистрации()
	
	ТекущиеДанные = Элементы.Состав.ТекущиеДанные;
	ПараметрыСтроки = Новый Структура(
		"ЗаявлениеОВвозе,НомерСтроки,НомерОтметкиОРегистрации,ДатаОтметкиОРегистрации,НетАналогичныхДокументов");
	ЗаполнитьЗначенияСвойств(ПараметрыСтроки, ТекущиеДанные);
	
	РеквизитыОтметкиОРегистрации = ПолучитьРеквизитыОтметкиОРегистрации(Объект, ПараметрыСтроки);
	
	Если РеквизитыОтметкиОРегистрации.НетАналогичныхДокументов Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.НомерОтметкиОРегистрации <> РеквизитыОтметкиОРегистрации.НомерОтметкиОРегистрации
		ИЛИ ТекущиеДанные.ДатаОтметкиОРегистрации <> РеквизитыОтметкиОРегистрации.ДатаОтметкиОРегистрации Тогда
		
		ИзменитьРеквизитыОтметкиОРегистрацииВТаблице(Объект, Элементы.Состав.ТекущиеДанные)
		
	КонецЕсли;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьРеквизитыОтметкиОРегистрации(Объект, ПараметрыСтроки)

	ПараметрыСтроки.НетАналогичныхДокументов = Истина;
	СтруктураОтбора = Новый Структура("ЗаявлениеОВвозе", ПараметрыСтроки.ЗаявлениеОВвозе);
	МассивНайденныхСтрок = Объект.Состав.НайтиСтроки(СтруктураОтбора);
	
	Если МассивНайденныхСтрок.Количество() > 0 Тогда
	
		Для Каждого СтрокаТаблицы Из МассивНайденныхСтрок Цикл
			
			Если СтрокаТаблицы.НомерСтроки <> ПараметрыСтроки.НомерСтроки Тогда
				ПараметрыСтроки.НетАналогичныхДокументов = Ложь;
				ЗаполнитьЗначенияСвойств(ПараметрыСтроки, СтрокаТаблицы, "НомерОтметкиОРегистрации,ДатаОтметкиОРегистрации");
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;

	Возврат ПараметрыСтроки;

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьРеквизитыОтметкиОРегистрацииВТаблице(Объект, ТекущиеДанные)

	СтруктураОтбора = Новый Структура("ЗаявлениеОВвозе", ТекущиеДанные.ЗаявлениеОВвозе);
	МассивНайденныхСтрок = Объект.Состав.НайтиСтроки(СтруктураОтбора);

	Если МассивНайденныхСтрок.Количество() > 0 Тогда
	
		Для Каждого СтрокаТаблицы Из МассивНайденныхСтрок Цикл
			
			Если СтрокаТаблицы.НомерСтроки <> ТекущиеДанные.НомерСтроки Тогда
				ЗаполнитьЗначенияСвойств(СтрокаТаблицы, ТекущиеДанные, "НомерОтметкиОРегистрации,ДатаОтметкиОРегистрации");
			КонецЕсли;
			
		КонецЦикла;
	
	КонецЕсли;

КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти
